package org.andstatus.personsmerger
import org.andstatus.personsmerger.TriResult.*

object PersonsData {
    val data: List<PersonsPair> = listOf(
        PersonsPair(0,
            Person("", "", "", "", "", "", "", "", "", "", ""),
            Person("", "", "", "", "", "", "", "", "", "", ""),
            FALSE
        ),
        PersonsPair(1000,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(1,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(2,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(3,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(4,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(5,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(6,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(7,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(8,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(9,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(10,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "6666", "6666", ""),
            TRUE
        ),
        PersonsPair(11,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(12,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(13,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(14,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),

        PersonsPair(15,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(16,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(17,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(21,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(22,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(23,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "6666", "", "6666", "5555", ""),
            FALSE
        ),
        PersonsPair(24,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "3333", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(25,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "6666", "2222", "3333", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(26,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(27,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(31,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "6666", "6666", ""),
            FALSE
        ),
        PersonsPair(32,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "3333", "", "6666", "6666", ""),
            FALSE
        ),
        PersonsPair(33,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "6666", "2222", "3333", "", "6666", "6666", ""),
            FALSE
        ),
        PersonsPair(34,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "6666", "6666", ""),
            FALSE
        ),
        PersonsPair(35,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "6666", ""),
            FALSE
        ),
        PersonsPair(36,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "6666", ""),
            FALSE
        ),
        PersonsPair(37,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "6666", ""),
            FALSE
        ),
        PersonsPair(41,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "6666", "", ""),
            TRUE
        ),
        PersonsPair(42,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(43,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(44,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(45,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(46,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "6666", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(47,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(51,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(52,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(53,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(54,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "6666", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(55,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "6666", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(56,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(57,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "3333", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(58,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(59,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Петровна", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(60,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(61,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(61,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(63,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(64,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(65,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(66,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(67,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(68,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(69,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "6666", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(70,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(72,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(73,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1959", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(74,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(75,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", " ",        "Иванов", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(76,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1959", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(77,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Петров", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(78,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(79,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(81,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(82,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(83,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "5555", ""),
            Person("Иван", "",         "Иванов", "01.01.1959", "1111", "6666", "", "", "4444", "5555", ""),
            UNKNOWN
        ),
        PersonsPair(84,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(85,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "3333", "", "4444", "", ""),
            FALSE
        ),


    )
}