package org.andstatus.personsmerger
import org.andstatus.personsmerger.TriResult.*

object PersonsData {
    val data: List<PersonsPair> = listOf(
//        PersonsPair(0,
//            Person("", "", "", "", "", "", "", "", "", "", ""),
//            Person("", "", "", "", "", "", "", "", "", "", ""),
//            FALSE
//        ),
// 11 заполнено, 2 пустых, 9 совпало
        PersonsPair(1000,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        // 11 заполнено, 2 пустых, 8 совпало
        PersonsPair(1,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(2,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(3,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(4,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(5,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(6,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(7,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(8,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(9,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        // 11 заполнено, 2 пустых, 7 из 9 совпало
        PersonsPair(10,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "6666", "6666", ""),
            TRUE
        ),
        PersonsPair(11,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(12,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(13,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(14,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),

        PersonsPair(15,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(16,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(17,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(18,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "6666", "2222", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(19,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "5555", ""),
            TRUE
        ),
        PersonsPair(20,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "6666", "5555", ""),
            TRUE
        ),
         PersonsPair(21,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "6666", "5555", ""),
            TRUE
        ),
        PersonsPair(22,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "6666", "5555", ""),
            TRUE
        ),
        // 11 заполнено, 2 пустых, 6 из 9 совпало
        PersonsPair(23,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "6666", "", "6666", "5555", ""),
            FALSE
        ),
        PersonsPair(24,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "3333", "", "6666", "5555", ""),
            UNKNOWN
        ),
        PersonsPair(25,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "6666", "2222", "3333", "", "6666", "5555", ""),
            UNKNOWN
        ),
        PersonsPair(26,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "6666", "5555", ""),
            UNKNOWN
        ),
        PersonsPair(27,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "6666", "5555", ""),
            FALSE
        ),
        PersonsPair(28,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "6666", "2222", "6666", "", "4444", "5555", ""),
            UNKNOWN
        ),
        PersonsPair(29,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1977", "1111", "2222", "6666", "", "4444", "5555", ""),
            UNKNOWN
        ),
        PersonsPair(30,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1977", "1111", "2222", "6666", "", "4444", "5555", ""),
            UNKNOWN
        ),
        PersonsPair(31,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "6666", "2222", "3333", "", "6666", "6666", ""),
            FALSE
        ),
        PersonsPair(35,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "6666", ""),
            UNKNOWN
        ),
        // 11 заполнено, 2 пустых, 5 из 9 совпало
        PersonsPair(32,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "6666", "3333", "", "6666", "6666", ""),
            FALSE
        ),
        PersonsPair(33,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "6666", "", "6666", "6666", ""),
            FALSE
        ),
        PersonsPair(34,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Петрович", "Иванов", "01.01.1977", "1111", "2222", "3333", "", "6666", "6666", ""),
            FALSE
        ),
        //11 заполнено, 7 из 9 совпало
        PersonsPair(36,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(37,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "5555", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "6666", ""),
            TRUE
        ),
        // 10 заполнено, 3 пустых, 8 из 8 совпало
        PersonsPair(40,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
// 10 заполнено, 3 пустых, 7 из 8 совпало
        PersonsPair(41,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "6666", "", ""),
            TRUE
        ),
        PersonsPair(411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(412,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(413,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(414,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(415,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
// 10 заполнено, 3 пустых, 6 из 8 совпало
        PersonsPair(42,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "6666", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(43,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(43,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(43,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(43,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(43,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "3333", "", "6666", "", ""),
            UNKNOWN
        ),

        PersonsPair(44,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(45,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "3333", "", "6666", "", ""),
            UNKNOWN
        ),
// 10 заполнено, 3 пустых, 5 из 8 совпало аполнен
        PersonsPair(46,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "6666", "", "6666", "", ""),
            FALSE
        ),
        PersonsPair(47,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "3333", "", "6666", "", ""),
            FALSE
        ),
        PersonsPair(48,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "6666", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(49,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "6666", "6666", "3333", "", "4444", "", ""),
            UNKNOWN
        ),
// 9 зополнено, 1 частично, 3 пустых, 7 из 7 совпало
                    PersonsPair(51,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(512,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(512,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(512,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(512,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(512,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        // 8 зополнено, 2 частично, 3 пустых, 6 из 6 совпало
        PersonsPair(513,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(513,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(513,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(513,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(513,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        // 8 зополнено, 1 частично, 3 пустых, 6 из 7 совпало
        PersonsPair(52,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(53,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            TRUE
        ),
        // 8 зополнено, 1 частично, 3 пустых, 5 из 7 совпало
        PersonsPair(54,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "6666", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(55,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "6666", "", "", "6666", ""),
            UNKNOWN
        ),
        PersonsPair(56,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "6666", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(56,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "6666", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(56,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(56,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(56,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(57,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "3333", "", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 1 частично, 3 пустых, 6 из 7 совпало     ?????
        PersonsPair(58,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(59,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Петровна", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            TRUE
        ),
        PersonsPair(60,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            TRUE
        ),
        // 8 зополнено, 2 частично, 3 пустых, 6 из 6 совпало
        PersonsPair(61,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        // 8 зополнено, 2 частично, 3 пустых, 5 из 6 совпало
        PersonsPair(62,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(63,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(64,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(65,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 2 частично, 3 пустых, 4 из 6 совпало
        PersonsPair(66,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(67,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(68,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(69,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "6666", "2222", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(70,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            FALSE
        ),
        // 8 зополнено, 3 частично, 3 пустых, 5 из 5 совпало
        PersonsPair(71,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        // 8 зополнено, 3 частично, 3 пустых, 4 из 5 совпало
        PersonsPair(71,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1977", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(712,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(713,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Петров", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(714,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 3 частично, 3 пустых, 3 из 5 совпало
        PersonsPair(72,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(73,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1959", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(74,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(741,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", " ", "", "", "5555", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(742,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", " ", "", "", "5555", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "6666", "2222", "", "3333", "", "", ""),
            FALSE
        ),
        // 8 зополнено, 3 частично, 3 пустых, 4 из 5 совпало
        PersonsPair(75,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", " ",        "Иванов", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(76,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1977", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(77,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Петров", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 4 частично, 3 пустых, 4 из 4 совпало
        PersonsPair(78,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
// 8 зополнено, 4 частично, 3 пустых, 3 из 4 совпало
        PersonsPair(79,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(79,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(79,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(79,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(79,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        // 8 зополнено, 2 частично, 3 пустых, 5 из 6 совпало
        PersonsPair(81,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(82,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(83,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "5555", ""),
            Person("Иван", "",         "Иванов", "01.01.1959", "1111", "6666", "", "", "4444", "5555", ""),
            UNKNOWN
        ),
        // 8 зополнено, 2 частично, 3 пустых, 4 из 6 совпало
        PersonsPair(84,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "4444", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(85,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "3333", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "3333", "", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 2 частично, 3 пустых, 4 из 5 совпало   ?????
        PersonsPair(86,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "3333", "", "4444", "", ""),
            UNKNOWN
        ),
//иностранцы
// 11 заполнено, 2 пустых, 9 совпало
        PersonsPair(100011,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        // 11 заполнено, 2 пустых, 8 совпало
        PersonsPair(111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "6666"),
            TRUE
        ),
        PersonsPair(211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "6666", "", "5555"),
            TRUE
        ),
        PersonsPair(311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "6666", "4444", "", "5555"),
            TRUE
        ),
        PersonsPair(411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        PersonsPair(511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        PersonsPair(611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        PersonsPair(711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        PersonsPair(811,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Петрович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        PersonsPair(911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        // 11 заполнено, 2 пустых, 7 из 9 совпало
        PersonsPair(1011,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "6666", "", "6666"),
            TRUE
        ),
        PersonsPair(1111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "6666", "4444", "", "6666"),
            TRUE
        ),
        PersonsPair(1211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", "6666"),
            TRUE
        ),
        PersonsPair(1311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "3333", "4444", "", "6666"),
            TRUE
        ),
        PersonsPair(1411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "", "3333", "4444", "", "6666"),
            TRUE
        ),

        PersonsPair(1511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "", "3333", "4444", "6666", ""),
            TRUE
        ),
        PersonsPair(1611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Петрович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "6666"),
            TRUE
        ),
        PersonsPair(1711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "6666"),
            TRUE
        ),
        PersonsPair(1811,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "6666", "2222", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        PersonsPair(1911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Петрович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", "5555"),
            TRUE
        ),
        PersonsPair(2011,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "6666", "6666", "", "5555"),
            TRUE
        ),
        PersonsPair(2111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "6666", "6666", "", "5555"),
            TRUE
        ),
        PersonsPair(2211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "6666", "", "5555"),
            TRUE
        ),
        // 11 заполнено, 2 пустых, 6 из 9 совпало
        PersonsPair(2311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "6666", "6666", "", "5555"),
            FALSE
        ),
        PersonsPair(2411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "", "3333", "6666", "", "5555"),
            UNKNOWN
        ),
        PersonsPair(2511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "6666", "2222", "", "3333", "6666", "", "5555"),
            UNKNOWN
        ),
        PersonsPair(2611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Петрович", "Иванов", "01.01.1959", "1111", "2222", "", "3333", "6666", "", "5555"),
            UNKNOWN
        ),
        PersonsPair(2711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Петр", "Иванович", "Петров", "01.01.1950", "1111", "2222", "", "3333", "6666", "", "5555"),
            FALSE
        ),
        PersonsPair(2811,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "6666", "2222", "", "6666", "4444", "", "5555"),
            UNKNOWN
        ),
        PersonsPair(2911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Петрович", "Иванов", "01.01.1977", "1111", "2222", "", "6666", "4444", "", "5555"),
            UNKNOWN
        ),
        PersonsPair(3011,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Петр", "Иванович", "Иванов", "01.01.1977", "1111", "2222", "", "6666", "4444", "", "5555"),
            UNKNOWN
        ),
        PersonsPair(3111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "6666", "2222", "", "6666", "6666", "", "6666"),
            FALSE
        ),
        PersonsPair(3511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", "6666"),
            UNKNOWN
        ),
        // 11 заполнено, 2 пустых, 5 из 9 совпало
        PersonsPair(3211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "6666", "", "3333", "6666", "", "6666"),
            FALSE
        ),
        PersonsPair(3311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "6666", "6666", "", "6666"),
            FALSE
        ),
        PersonsPair(3411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Петрович", "Иванов", "01.01.1977", "1111", "2222", "", "3333", "6666", "", "6666"),
            FALSE
        ),
        //11 заполнено, 7 из 9 совпало
        PersonsPair(3611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", "6666"),
            TRUE
        ),
        PersonsPair(3711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", "5555"),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", "6666"),
            TRUE
        ),
        // 10 заполнено, 3 пустых, 8 из 8 совпало
        PersonsPair(4011,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
// 10 заполнено, 3 пустых, 7 из 8 совпало
        PersonsPair(4111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "6666", "", ""),
            TRUE
        ),
        PersonsPair(41111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "6666", "4444", "", ""),
            TRUE
        ),
        PersonsPair(41211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(41311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(41411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(41511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
// 10 заполнено, 3 пустых, 6 из 8 совпало
        PersonsPair(4211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "6666", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(4311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(4311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(4311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(4311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(4311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "3333", "6666", "", ""),
            UNKNOWN
        ),

        PersonsPair(4411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "3333", "6666", "", ""),
            UNKNOWN
        ),
        PersonsPair(4511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "2222", "", "3333", "6666", "", ""),
            UNKNOWN
        ),
// 10 заполнено, 3 пустых, 5 из 8 совпало аполнен
        PersonsPair(4611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "6666", "6666", "", ""),
            FALSE
        ),
        PersonsPair(4711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "", "3333", "6666", "", ""),
            FALSE
        ),
        PersonsPair(4811,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "", "6666", "4444", "", ""),
            FALSE
        ),
        PersonsPair(4911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "6666", "6666", "", "3333", "4444", "", ""),
            UNKNOWN
        ),
// 9 зополнено, 1 частично, 3 пустых, 7 из 7 совпало
        PersonsPair(5111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        // 8 зополнено, 2 частично, 3 пустых, 6 из 6 совпало
        PersonsPair(513,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(51311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        // 8 зополнено, 1 частично, 3 пустых, 6 из 7 совпало
        PersonsPair(5211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(5311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Петров", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            TRUE
        ),
        // 8 зополнено, 1 частично, 3 пустых, 5 из 7 совпало
        PersonsPair(5411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "6666", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(5511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "6666", "", "6666", ""),
            UNKNOWN
        ),
        PersonsPair(5611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "6666", "", "3333", "", "", ""),
            TRUE
        ),
        PersonsPair(5611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "6666", "", "3333", "", "", ""),
            TRUE
        ),
        PersonsPair(5611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "", "3333", "", "", ""),
            TRUE
        ),
        PersonsPair(5611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "", "3333", "", "", ""),
            TRUE
        ),
        PersonsPair(5611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1959", "1111", "6666", "", "3333", "", "", ""),
            TRUE
        ),
        PersonsPair(5711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "", "3333", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 1 частично, 3 пустых, 6 из 7 совпало     ?????
        PersonsPair(5811,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Петр", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(5911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Петровна", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            TRUE
        ),
        PersonsPair(6011,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            TRUE
        ),
        // 8 зополнено, 2 частично, 3 пустых, 6 из 6 совпало
        PersonsPair(6111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        // 8 зополнено, 2 частично, 3 пустых, 5 из 6 совпало
        PersonsPair(6211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(6311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(6411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(6511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 2 частично, 3 пустых, 4 из 6 совпало
        PersonsPair(6611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(6711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(6811,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(6911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Иванов", "01.01.1977", "6666", "2222", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(7011,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "Иванович", "Петрова", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            FALSE
        ),
        // 8 зополнено, 3 частично, 3 пустых, 5 из 5 совпало
        PersonsPair(7111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            TRUE
        ),
        // 8 зополнено, 3 частично, 3 пустых, 4 из 5 совпало
        PersonsPair(7111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(7111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(7111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(7111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(7111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1977", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Петров", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(71411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 3 частично, 3 пустых, 3 из 5 совпало
        PersonsPair(7211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(7311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1959", "1111", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(7411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(74111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", " ", "", "", "5555", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(74211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", " ", "", "", "5555", ""),
            Person("Петр", "",         "Иванов", "01.01.1950", "6666", "2222", "", "3333", "", "", ""),
            FALSE
        ),
        // 8 зополнено, 3 частично, 3 пустых, 4 из 5 совпало
        PersonsPair(7511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", " ",        "Иванов", "01.01.1950", "6666", "2222", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(7611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1977", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(7711,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Петров", "01.01.1950", "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 4 частично, 3 пустых, 4 из 4 совпало
        PersonsPair(7811,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "2222", "", "", "4444", "", ""),
            UNKNOWN
        ),
// 8 зополнено, 4 частично, 3 пустых, 3 из 4 совпало
        PersonsPair(7911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(7911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(7911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(7911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        PersonsPair(7911,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "",           "1111", "6666", "", "", "4444", "", ""),
            FALSE
        ),
        // 8 зополнено, 2 частично, 3 пустых, 5 из 6 совпало
        PersonsPair(8111,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", ""),
            TRUE
        ),
        PersonsPair(8211,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "", "4444", "", ""),
            TRUE
        ),
        PersonsPair(8311,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", "5555"),
            Person("Иван", "",         "Иванов", "01.01.1959", "1111", "6666", "", "", "4444", "", "5555"),
            UNKNOWN
        ),
        // 8 зополнено, 2 частично, 3 пустых, 4 из 6 совпало
        PersonsPair(8411,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "4444", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "", "", "4444", "", ""),
            UNKNOWN
        ),
        PersonsPair(8511,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "3333", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "6666", "6666", "", "3333", "4444", "", ""),
            UNKNOWN
        ),
        // 8 зополнено, 2 частично, 3 пустых, 4 из 5 совпало   ?????
        PersonsPair(8611,
            Person("Иван", "Иванович", "Иванов", "01.01.1950", "1111", "2222", "", "", "", "", ""),
            Person("Иван", "",         "Иванов", "01.01.1950", "1111", "6666", "", "3333", "4444", "", ""),
            UNKNOWN
        ),

    )
}